{ "typ":"Text",   
  "titel":"Linienstaerke bei Kreisen, Rechtecken und Dreiecken",
  "untertitel":"Überladen von Konstruktoren",
  "blueJ":"ProcessingLinienstaerke/sketch_07dLinienstaerke.zip",
  "angabe":[
    {"zeit":15,"txt":"Erstelle in der Klasse Form ein neues Attribut linienstaerke vom Typ int, auf das auch in den Unterklassen zugegriffen werden kann." },
    {"zeit":15,"txt":"Erstelle eine öffentliche get- und set-Methode für das neue Attribut."},
    {"zeit":15,"txt":"Initialisiere das Attribut linienstaerke im ersten Konstruktor mit dem Wert 1 als Standardwert."},
    {"zeit":15,"txt":"Erstelle einen neuen Konstruktor, der 5 Parameter benötigt: x,y,farbe,linienfarbe,linienstaerke"},
    {"zeit":15,"txt":"Rufe in der 1. Zeile des neuen Konstruktors den zweiten Konstruktor mit der Anweisung <b>this(x,y,farbe,linienfarbe);</b> auf.<br>Initialisiere in der 2. Zeile das Attribut linienstaerke mit dem Parameter-Wert."},
    {"zeit":15,"txt":"Füge in der Methode show() als 1. Zeile die Anweisung <b>strokeWeight(linienstaerke)</b> ein, damit die Linienstaerke gesetzt wird."},
    {"zeit":15,"txt":"Erzeuge in der Klasse Dreieck einen neuen Konstruktor, der 9 Parameter benötigt: x, y, dx1, dy1, dx2, dy2, farbe, linienfarbe, linienstaerke)"},
    {"zeit":15,"txt":"Rufe in der ersten Zeile des Konstruktors den neuen Konstruktor der Oberklasse auf."},
    {"zeit":15,"txt":"Initialisiere anschließend die Attribute dx1, dy1, dx2, dy2 mit den Parameter-Werten."},
    {"zeit":15,"txt":"Erstelle in der Klasse Rechteck einen neuen Konstruktor, mit dem die Linienstaerke gesetzt werden kann."},
    {"zeit":15,"txt":"Erstelle in der Klasse Kreis ebenfalls einen neuen Konstruktor, mit dem die Linienstaerke gesetzt werden kann."},
    {"zeit":15,"txt":"Erstelle in der Klasse Linie auch einen neuen Konstruktor, mit dem die Linienstaerke gesetzt werden kann."}
    
   
    
    
    
    
  ],
 
  "txtAngabe": [

   ],
 

  "ende":"Super, du hast die Aufgaben gelöst.<br>Du kannst jetzt bei allen Klassen die Linienstaerke einstellen.",
  "copyright":"<a href='https://processing.org/'>Processing</a> "
    
}