{ "typ":"Text",   
  "titel":"Quadrat - eine Unterklasse von Rechteck",
  "untertitel":"Überladen von Konstruktoren III",
  "blueJ":"ProcessingQuadrat/sketch_07fQuadrat.zip",
  "angabe":[
    {"zeit":1,"txt":"Erstelle eine neue Klasse Quadrat, die sich von der Klasse Rechteck ableitet." },
    {"zeit":1,"txt":"Erstelle einen Konstruktor der Klasse Quadrat ohne Parameter.<br>Rufe in der 1. Zeile den Konstruktor der Oberklasse auf und erzeuge ein Standard-Rechteck an der Position x=50,y=100, mit der Länge und Breite 50 und der Füllfarbe weiß."},
    {"zeit":1,"txt":"<ol><li>Deklariere in der Sketch-Klasse ein Objekt q1 der Klasse Quadrat.</li><li>Initalisiere in der setup-Methode dieses Objekt durch den Aufruf des neuen Konstruktors ohne Parameter.</li><li>Rufe in der draw-Methode die show()-Methode des Objekts q1 auf.</li></ol>"},
    {"zeit":1,"txt":"Damit das Quadrat an beliebigen Stellen erscheinen kann, benötigen wir einen zweiten Konstruktor mit den Parameter x und y.<br>Kopiere den ersten Konstruktor und ändere die Kopie so ab, dass sie zwei Parameter x und y vom Typ int benötigt und beim Aufruf des Konstruktors der Oberklasse verwendet."},
    {"zeit":1,"txt":"Verändere die setup-Methode der Sketch-Klasse so, dass q1 an der Position (100,100) erscheint."},
   
    {"zeit":1,"txt":"Durch einen dritten Parameter b vom Typ int soll die Breite des Quadrats festgelegt werden.<br>Kopiere den zweiten Konstruktor der Klasse Quadrat und passe ihn entsprechend an."},
    {"zeit":1,"txt":"Erzeuge einen vierten Konstruktor, bei dem mit einem vierten Parameter die Farbe des Quadrats festgelegt werden kann."},
    {"zeit":1,"txt":"Erzeuge zwei weitere Konstruktoren:<ol><li>Zusätzlich zu allen anderen Parametern soll die Linienfarbe festgelegt werden können.</li><li>Als letzter Parameter soll die Linienstärke definiert werden.</li></ol>"},
    {"zeit":1,"txt":"Erzeuge in der Sketch-Klasse ein Bild aus vier verschiedenfarbigen Quadraten, die direkt nebeneinander liegen."}
    
   
    
    
    
    
  ],
 
  "txtAngabe": [

   ],
 

  "ende":"Super, du hast die Aufgaben gelöst.<br>Du kannst jetzt bei allen Klassen die Linienstaerke einstellen.",
  "copyright":"<a href='https://processing.org/'>Processing</a> "
    
}